{
  "basic_info": {
    "description_header": "Hi, I'm Jon",
    "description": "👋 I am a Software Developer with experience in software testing, systems administration, project planning and team leadership. I began my career in technology as a Helpdesk Associate, solving desktop issues of staff and assisting in maintenance of the network and systems. My interest in IT was piqued, so I went to Cascadia College and earned an AA in Network Technologies, making Honors and President's List multiple times, and created a computer asset-tracking tool for the Campus SysAdmins, helping them forecast budget needs. Following graduation I interning at a Citrix office in Redmond, WA, maintaining computer lab hardware and providing basic helpdesk support for the small remote office. I was promoted to Systems Administrator and collaborated with a software developer to design and deploy a hardware management tool that helped increase equipment sharing between users, and simplified budget forecasting for the team. Over several years in this role I specified equipment like network infrastructure, servers and workstations, and SAN and NAS equipment, which I also deployed and maintained. I built-out dev and test team environments on hardware, hypervisors, and Azure, and and upgraded the computer lab network, supporting more devices and users, and segmenting campus and isolated networks using VLANs and routing. I took the lead in investigating and resolving intermitted issues with global Distributed File System shares using PowerShell and other tools, removing access errors and improving network performance. Working with PowerShell helped build my interest in software development so I earned a certification in Software Test Engineering from Bellevue College, where I picked up skills in Python, C#, Git, SQL, and software development lifecycles. Soon after, I moved into a software testing role and designed test plans and executed tests, submitting concrete yet succinct bug reports, and validating buf-fixes on multiple simultaneous projects. I developed automated build-and-deploy scripts using PowerShell, and created one-button-execution UI testing using Selenium Driver and Python, detecting UI bugs and allowing more time for continued Lab Manager and Systems Admin tasks completion. I returned to Bellevue College to complete C# Programming training and started to enjoy working in object-oriented, stronly-typed languages. Wanting to learn more and work on teams, I attained a certificate in Advanced Software Development in Java from Code Fellows in Seattle, WA. As a bonus, I learned how to build full-stack Web Apps using HTML, CSS, JS, React, Express, SQL and No-SQL databases, and work closely with fellow students using agile software development techniques. In between classes and projects I started applying my skills to ham radio by building radio-interfacing electronics and developing software. In one case, a specialized web form was needed by radio operators for an upcoming event. I customized an existing web form, updating the UI for simplicity and to be accessible to elderly, limited visdio, or limited mobility users. I refactored the form's HTML, CSS, and JavaScript for clean, readability, and added elements and responsiveness to the form. In late 2022, I met an enthusiastic React developer and we jointly designed, developed, and bug tested a React SPA using common software development tools and technique, all while completely remote from each other. I enjoy developing software solutions for web and desktop, and engaging in finding solutions that make sense for the context of the application. I look forward to working on a diverse, engaged software development team, creating and refining technical solutions and delighting customers.👋",
    "section_name": {
      "about": "About me",
      "projects": "Projects",
      "skills": "Skills",
      "experience": "Experience"
    }
  },
  "projects": [
    {
      "title": "Coordinate Conversion Utility",
      "startDate": "2019",
      "description": "As an amateur radio operator I need to be aware of several different coordinate systems to identify where I am, and where other operators might be. As a software developer I want to develop an application that will help me convert from 4 common coordinate system notations. Many hams before me have explored solving coordinate conversion in software however I enjoyed the challenge and the achievement.",
      "images": [
        "images/portfolio/CoordinateConverter/grid-commands-with-conversion-outputs.jpg",
        "images/portfolio/CoordinateConverter/dd-commands-with-conversion-outputs.jpg",
        "images/portfolio/CoordinateConverter/unittests-full-suite-of-componentized-tests.jpg"
      ],
      "url": "https://github.com/nojronatron/CoordinateConversionUtility",
      "technologies": [
        {
          "class": "devicon-dot-net-plain",
          "name": "DotNET 4"
        },
        {
          "class": "devicon-dot-net-plain",
          "name": "DotNET 6"
        },
        {
          "class": "devicon-csharp-plain",
          "name": "C#"
        }
      ]
    },
    {
      "title": "LingoBing JS",
      "startDate": "2022",
      "description": "Working with Ryan Schafer on our spare time, we re-wrote the LingoBingo project using React. We are are finishing up the first part of a v.1 release that implements MERN-stack design pattern, and will follow that with an add-on UI for Presenters to add their own words and generate a web-link to their custom-defined LingoBingo boards.",
      "images": ["images/portfolio/lbjs/lbjs-lets-play-bingo.jpg"],
      "url": "https://eb-lingobingo.netlify.app/",
      "technologies": [
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        },
        {
          "class": "devicon-react-plain",
          "name": "React.js"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "Node.js"
        }
      ]
    },
    {
      "title": "EZ-PC Shopper",
      "startDate": "2022",
      "description": "Final project for CodeFellows Code 201 class, helps site visitors build and buy a computer system from the ground up. This project challenged me to refine my bug finding and squashing abilities, acquire a deeper understanding of CSS 3.0, and experience project management by guiding meetings, project design, and pair-programming with my team mates.",
      "images": ["images/portfolio/EZPCShopper/EZ-PC-Shopper screenshot.jpg"],
      "url": "https://it-s-not-a-bug-it-s-a-feature.github.io/EZ-PC-Shopper/",
      "technologies": [
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        },
        {
          "class": "devicon-html5-plain",
          "name": "HTML 5"
        },
        {
          "class": "devicon-css3-plain",
          "name": "CSS 3.0"
        }
      ]
    },
    {
      "title": "Salmon Cookies",
      "startDate": "2022",
      "description": "Code Fellows Code 201 Lab Project Cookie Stand provided an opportunity to put together JavaScript, HTML 5, CSS 3.0 to meet the goal of presenting a new website for a ficticious, growing business. Using DOM Manipulation to edit the UI, HTML 5 Forms, and CSS features to manage images, content, and coloring style were the focus features. I enjoyed working on this project!",
      "images": [
        "images/portfolio/SalmonCookies/salmon-cookies screenshot.jpg"
      ],
      "url": "https://nojronatron.github.io/cookie-stand/",
      "technologies": [
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        },
        {
          "class": "devicon-html5-plain",
          "name": "HTML 5"
        },
        {
          "class": "devicon-css3-plain",
          "name": "CSS 3.0"
        }
      ]
    },
    {
      "title": "LingoBingo",
      "startDate": "2019",
      "description": "One of the first web apps I worked on using C# DotNET Blazor Web Assembly. The original idea came from a webinar on audience engagement by Cindy Huggett, where she suggested presenters play Buzzword Bingo so audience members could yell BINGO when they match 5 presenter-planned buzzwords in a row. The project has been through many version, from Console application to what it is now - a live, playable Azure WebApp. I learned a lot about C#, Dot NET, and web development, which made it clear to me I wanted to learn more about building capable, fun websites!",
      "images": ["images/portfolio/LingoBingo/LingoBingo screenshot.jpg"],
      "url": "https://bit.ly/3lgqSWe",
      "technologies": [
        {
          "class": "devicon-csharp-plain",
          "name": "C#"
        },
        {
          "class": "devicon-dot-net-plain",
          "name": "Blazor"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "Citrix Systems, Inc",
      "title": "Software Test Engineer II",
      "years": "April 2014 - July 2017",
      "mainTech": [
        "Test Planning, Execution, Reporting, and Systems Admining."
      ],
      "technologies": [
        "Visual Studio 2012, 2016",
        "PyCharm",
        "Azure WebApps and VMs",
        "Selenium",
        ".NET Framework",
        "Python 3.x",
        "Jira",
        "BitBucket and Git"
      ]
    },
    {
      "company": "Citrix Systems, Inc",
      "title": "Engineering Systems Administrator II",
      "years": "2006 - 2014",
      "mainTech": ["Manage dev-test lab, networks, Active Directory."],
      "technologies": [
        "Windows Server 2008 through 2012 R2",
        "PowerShell",
        "Active Directory",
        "DHCP, DNS, and WINS infrastructure",
        "Hardware and software deployment",
        "Disaster Recover specification and management"
      ]
    },
    {
      "company": "Citrix Systems, Inc",
      "title": "Computer Lab Technician - Intern",
      "years": "2004 - 2006",
      "mainTech": ["Build-fix computers, maintain lab and network."],
      "technologies": [
        "Windows Server 2000, 2008",
        "Windows Vista, 7",
        "TCP/IP, DHCP, DNS, WINS",
        "Hardware and software deployment",
        "Build, service computer hardware",
        "Automate build computer config"
      ]
    },
    {
      "company": "Cascadia College",
      "title": "Helpdesk Support",
      "years": "2003, 2004",
      "mainTech": ["Technical support, student resource, admin assistant."],
      "technologies": [
        "Technical Support",
        "Helpdesk application operator",
        "Windows Server 2000",
        "Windows XP",
        "Active Directory",
        "Server room hardware management",
        "Disaster Recover spec and mgmt"
      ]
    }
  ]
}
