{
  "basic_info": {
    "description_header": "Hi, I'm Jon",
    "description": [
      "👋  I am a Software Developer with experience in software testing, systems administration, project planning and team leadership. I began my career in technology as a Helpdesk Associate, then as a Computer Lab Technician, and later as a Windows Systems Administrator. While earning a Associate Degree in Network Technologies, I created a computer asset-tracking database tool for the campus IT team that helped track computers and forecast budget needs.",
      "Later, as a Systems Administrator at Citrix Systems, I managed the computer lab hardware, data storage, and network systems. Through collaboration with a software developer I helped design and deploy a hardware management tool that increased computer lab equipment utilization and simplified budget forecasting for the team's leadership. I also built-out dev and test team environments on hardware, hypervisors and Azure, reducing time-to-deploy for dev and test activities. ",
      "I acquired bids for electrical work and network upgrades, and implemented routing and VLAN technologies to support secure dev and production systems network performance. As an Systems Admin of a globally reaching Active Directory deployment, I was responsible for network operations supporting the Engineering teams. I took the lead on several occasions to push for implementation of new features, solving issues affecting users globally, and upgrading services like SharePoint, improving user experience and productivity.",
      "Working in an advanced software development group, coupled with my growing experiences with PowerShell, I earned a certification in Software Test Engineering from Bellevue College where I picked up Python, C#, Git, SQL, and agile software development processes. Soon after, I moved into a software testing role at Citrix, designing test plans, executing tests, submitted concrete yet succinct bug reports, and validating bug-fixes on multiple projects, simultaneously. I developed automated build-and-deploy scripts using PowerShell, and created one-button-execution UI testing using Selenium Driver and Python, detecting UI bugs and allowing more time for continued Lab Manager and Systems Admin tasks completion. ",
      "I returned to Bellevue College to complete C# Programming training and started to enjoy working with object-oriented, stronly-typed languages. Wanting to go further, I earned a certificate in Advanced Software Development in Java from Code Fellows in Seattle, WA, where I learned how to build full-stack Web Apps using HTML, CSS, JS, React, Express, SQL and No-SQL databases, as well as collaborative software development techniques including pair-programming and use of agile tools like Trello and Miro to design solutions and manage development progress.",
      "In between classes and projects I applied my skills to my ham radio hobby by building radio-interfacing electronics and developing software to capture and transform data. For example, I made improvements and added specific, necessary features to an existing web-based form that radio operators use to transmit urgent, emergent, or logistical messages via 'email over ham radio'. I updated the UI for simplicity and accessibility including those with limited vision and limited mobility users, and refactored the code to be clean and easily readable. ",
      "In late 2022, I met an enthusiastic React developer and we jointly designed, developed, and bug tested a React SPA using common software development tools and technique, all while completely remote from each other. This project is a web-based Bingo game that allows a presenter to create a custom Bingo board and share a link to the board with their audience. The audience can then play Bingo by clicking on the board's squares to mark them as 'called'. The presenter can see the audience's boards and can call out the next square to be marked. The project is currently in development to be a full-stack app, published to Netlify and Azure App Services.",
      "I enjoy developing software solutions for web and desktop, working with engaging people, and finding solutions that make sense for the context of the end user. I look forward to working on a diverse software development team creating and refining technical solutions and delighting customers. 👋"
    ],
    "section_name": {
      "about": "About",
      "projects": "Projects",
      "skills": "Skills",
      "experience": "Experience",
      "codingLanguages": "Languages",
      "tools": "Tools and Frameworks"
    }
  },
  "projects": [
    {
      "title": "BF-BMX",
      "startDate": "2024",
      "description": "Many of my volunteer adventures include tracking cyclists or runners on a course. For one event, Bigfoot 200, hams use \"email over ham radio\" to send in runner reports. I developed a multi-project solution using DotNET 8 and WPF that watches for these reports, parses and logs the location data, and then posts the data to an ASP.NET Minimal API Server with an Entity Framework Core DB. The ham responsible for maintaining runner locations, can run reports against the logged data and answer questions like which runners has passed through a specific Aid Station. While specific to Bigfoot 200, the project is designed to be adaptable to other events. This project was designed to work in conjunction with the Bigfoot Bib Report Form project, and had its first trial-run in August 2024.",
      "images": [
        "images/portfolio/BF-BMX/bfbmx-desktop-overview-655x385.png",
        "images/portfolio/BF-BMX/bfbmx-system-topology-april-2024.png"
      ],
      "url": "https://github.com/nojronatron/BF-BMX",
      "technologies": [
        {
          "class": "devicon-visualstudio-plain colored",
          "name": "Visual Studio"
        },
        {
          "class": "devicon-dot-net-plain-wordmark colored",
          "name": "DotNET 6"
        },
        {
          "class": "devicon-dotnetcore-plain colored",
          "name": "ASP.NET Core"
        }
      ]
    },
    {
      "title": "Create Markdown TOC",
      "startDate": "2023",
      "description": "Some markdown files can get rather large with lots of headings, making it difficult to find information within. Using a table of contents speeds locating sections of interest, making it easier to find what you are looking for. With this extension, you can generate a table of contents in your markdown file without having to manually find and type out each heading. ",
      "images": [
        "images/portfolio/CreateTOC/markdown-toc-nextline-file.png",
        "images/portfolio/CreateTOC/markdown-toc-nextline-table-of-contents.png",
        "images/portfolio/CreateTOC/markdown-toc-vscode-extension-marketplace.png",
        "images/portfolio/CreateTOC/markdown-toc-create-toc-video.gif",
        "images/portfolio/CreateTOC/markdown-toc-closed-atx-with-headings.png",
        "images/portfolio/CreateTOC/markdown-toc-closed-atx-updated-with-toc.png"
      ],
      "url": "https://github.com/nojronatron/markdown-toc",
      "technologies": [
        {
          "class": "devicon-vscode-plain colored",
          "name": "VSCode Extensions API"
        },
        {
          "class": "devicon-javascript-plain colored",
          "name": "JavaScript"
        },
        {
          "class": "devicon-mocha-plain colored",
          "name": "Mocha Unit Tests"
        }
      ]
    },
    {
      "title": "LingoBing JS",
      "startDate": "2022",
      "description": "Working in our spare time, Ryan Shafer and I re-wrote the LingoBingo project using React. We are are finishing up the first part of a v.1 release that implements MERN-stack design pattern, and will follow that with an add-on UI for Presenters to add their own words and generate a web-link to their custom-defined LingoBingo boards.",
      "images": ["images/portfolio/lbjs/lbjs-lets-play-bingo.jpg"],
      "url": "https://eb-lingobingo.netlify.app/",
      "technologies": [
        {
          "class": "devicon-javascript-plain colored",
          "name": "JavaScript"
        },
        {
          "class": "devicon-react-original-wordmark colored",
          "name": "React.js"
        },
        {
          "class": "devicon-nodejs-plain-wordmark colored",
          "name": "Node.js"
        }
      ]
    },
    {
      "title": "Bigfoot Bib Report Form",
      "startDate": "2021",
      "description": "Destination Trail holds an annual ultramarathon event in the Gifford-Pinchot Nat'l Forest in SW Washington State called Bigfoot 200. Hams from all around Washington and Oregon volunteer to provide communications for this event including, information on runner locations, as well as logistical and emergency communications with Net Control near the event base. The Winlink Development Team (www.winlink.org) developed a form to capture participant data at checkpoints or Aid Stations for events like this. I cleaned-up and customized the form using HTML 5, CSS 3, and JavaScript to meet the needs of Aid Station HAMs while tracking runners for this event. Design improvements include: Use of accessible colors and fonts, selected control highlighting, keyboard navigation, and a responsive UI for desktop, mobile, and tablet devices. Features include: Automated subject line generation, comma-separated data display, and data backup and restore, allowing standalone form usage so a HAM can fill out the form, save the data, and then sneaker net it to a Winlink station for transmission. Every year the form is updated with new features and improvements using input from the HAMs who use it.",
      "images": [
        "images/portfolio/BfBibReportForm/initial-page-load-600px.jpg",
        "images/portfolio/BfBibReportForm/6-change-aid-station-changes-subject-600px.jpg",
        "images/portfolio/BfBibReportForm/6b-change-aid-station-changes-subject-600px.jpg",
        "images/portfolio/BfBibReportForm/7-8-9-bib-time-yesterday-600px.jpg",
        "images/portfolio/BfBibReportForm/11-newest-entry-always-on-top-row-600px.jpg",
        "images/portfolio/BfBibReportForm/13-save-big-data-to-json-text-file-for-easy-transport-600px.jpg"
      ],
      "url": "https://github.com/nojronatron/Bigfoot-Bib-Report-WL-Form",
      "technologies": [
        {
          "class": "devicon-javascript-plain colored",
          "name": "JavaScript"
        },
        {
          "class": "devicon-html5-plain-wordmark colored",
          "name": "HTML 5"
        },
        {
          "class": "devicon-css3-plain-wordmark colored",
          "name": "CSS 3.0"
        }
      ]
    },
    {
      "title": "EZ-PC Shopper",
      "startDate": "2022",
      "description": "Final project for CodeFellows Code 201 class, designed to help web site users build and buy a computer system regardless of their knowledge of computers. This project challenged me to refine my bug finding and squashing skills, acquire a deeper understanding of CSS 3.0, and experience project management by guiding meetings, assisting with UI and functional design, and exercise pair-programming with my team mates.",
      "images": [
        "images/portfolio/EZPCShopper/ez-pc-shopper-homepage.jpg",
        "images/portfolio/EZPCShopper/ez-pc-custom-hamburger-flyout-menu.jpg",
        "images/portfolio/EZPCShopper/EZ-PC-Shopper screenshot.jpg"
      ],
      "url": "https://it-s-not-a-bug-it-s-a-feature.github.io/EZ-PC-Shopper/",
      "technologies": [
        {
          "class": "devicon-javascript-plain colored",
          "name": "JavaScript"
        },
        {
          "class": "devicon-html5-plain-wordmark colored",
          "name": "HTML 5"
        },
        {
          "class": "devicon-css3-plain-wordmark colored",
          "name": "CSS 3.0"
        }
      ]
    },
    {
      "title": "Salmon Cookies",
      "startDate": "2022",
      "description": "Code Fellows Code 201 Lab Project Cookie Stand provided an opportunity to put together JavaScript, HTML 5, CSS 3.0 to meet the goal of presenting a new website for a ficticious, growing business. The website uses HTML 5, CSS 3, and JavaScript. DOM manipulation is used to edit the UI to respond to user inputs and changes in stored data. HTML Forms and other structural tags, along with CSS features, were chosen carefully to make the site responsive, supporting phone-sized viewports. Managing images, content, and style were the focus features of this project, and I am proud of my very first JavaScript-enabled website project.",
      "images": [
        "images/portfolio/SalmonCookies/salmon-cookies-home-page.jpg",
        "images/portfolio/SalmonCookies/salmon-cookies-home-page-footer.jpg",
        "images/portfolio/SalmonCookies/salmon-cookies-home-page-phone-sized.jpg",
        "images/portfolio/SalmonCookies/salmon-cookies-sales-report-custom-entry-form.jpg"
      ],
      "url": "https://nojronatron.github.io/cookie-stand/",
      "technologies": [
        {
          "class": "devicon-javascript-plain colored",
          "name": "JavaScript"
        },
        {
          "class": "devicon-html5-plain-wordmark colored",
          "name": "HTML 5"
        },
        {
          "class": "devicon-css3-plain-wordmark colored",
          "name": "CSS 3.0"
        }
      ]
    },
    {
      "title": "LingoBingo",
      "startDate": "2019",
      "description": "One of the first web apps I worked on using C# DotNET Blazor Web Assembly. The original idea came from a webinar on audience engagement by Cindy Huggett, where she suggested presenters play Buzzword Bingo so audience members could yell BINGO when they match 5 presenter-planned buzzwords in a row. The project has been through many version, from Console application to what it is now - a live, playable Azure WebApp. I learned a lot about C#, Dot NET, and web development, which made it clear to me I wanted to learn more about building capable, fun websites!",
      "images": ["images/portfolio/LingoBingo/LingoBingo screenshot.jpg"],
      "url": "https://bit.ly/3lgqSWe",
      "technologies": [
        {
          "class": "devicon-csharp-plain colored",
          "name": "C#"
        },
        {
          "class": "devicon-dotnetcore-plain colored",
          "name": "Blazor"
        }
      ]
    },
    {
      "title": "Coordinate Converter",
      "startDate": "2019",
      "description": "As an amateur radio operator I need to be aware of several different coordinate systems to identify where I am, and where other operators might be. As a software developer I want to develop an application that will help me convert from 4 common coordinate system notations. Many hams before me have explored solving coordinate conversion in software however I enjoyed the challenge and the achievement.",
      "images": [
        "images/portfolio/CoordinateConverter/grid-commands-with-conversion-outputs.jpg",
        "images/portfolio/CoordinateConverter/dd-commands-with-conversion-outputs.jpg",
        "images/portfolio/CoordinateConverter/unittests-full-suite-of-componentized-tests.jpg"
      ],
      "url": "https://github.com/nojronatron/CoordinateConversionUtility",
      "technologies": [
        {
          "class": "devicon-dot-net-plain-wordmark colored",
          "name": "DotNET 4"
        },
        {
          "class": "devicon-dot-net-plain-wordmark colored",
          "name": "DotNET 6"
        },
        {
          "class": "devicon-csharp-plain colored",
          "name": "C#"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "Destination Trail",
      "title": "HAM Team Lead Volunteer",
      "icon": "fas fa-hands-helping",
      "years": "2016 - 2024",
      "mainTech": ["Software", "Communications", "Team Lead", "Planning"],
      "technologies": [
        "Effective HAM Communications",
        "Planning and Logistics",
        "Technical Support",
        "Winlink SME",
        "Minor First Aid",
        "BF-BMX Project",
        "Bigfoot Bib Report Form"
      ]
    },
    {
      "company": "National Multiple Sclerosis Society",
      "title": "Supplies and Gear HAM",
      "icon": "fas fa-hands-helping",
      "years": "2013 - 2024",
      "mainTech": ["Communications Infra", "Safety", "Support", "Planning"],
      "technologies": [
        "HAM Communications and SME",
        "Network and Comms Infrastructure",
        "Technical Support",
        "Minor First Aid",
        "Minor Bike Repair",
        "Clean Driving Record",
        "Event Planning"
      ]
    },
    {
      "company": "Various Organizations",
      "title": "Radio Comms and Logistics Volunteer",
      "icon": "fas fa-hands-helping",
      "years": "2013 - 2024",
      "mainTech": ["Logistics", "Communications", "Safety", "Support"],
      "technologies": [
        "HAM Communications",
        "Planning and Logistics",
        "Technical Support",
        "Minor First Aid",
        "Effective Station Setup, Operation"
      ]
    },
    {
      "company": "Citrix Systems, Inc",
      "title": "Software Test Engineer II",
      "icon": "fas fa-laptop-code",
      "years": "April 2014 - July 2017",
      "mainTech": ["Tests", "Planning", "Reporting", "Bugs", "Domain Admin"],
      "technologies": [
        "Visual Studio",
        "PyCharm",
        "Azure WebApps and VMs",
        "Selenium",
        ".NET Framework",
        "Python 3",
        "Jira",
        "BitBucket and Git"
      ]
    },
    {
      "company": "Citrix Systems, Inc",
      "title": "Engineering Sys Admin II",
      "icon": "fas fa-laptop-code",
      "years": "2006 - 2014",
      "mainTech": ["Manage Lab", "LAN Admin", "Active Directory Admin"],
      "technologies": [
        "Windows Server",
        "PowerShell",
        "Active Directory",
        "DHCP, DNS, and WINS",
        "Plan, Specify, Purchase",
        "Hyper-V, VMWare, Dell, HP",
        "Data Recovery"
      ]
    },
    {
      "company": "Citrix Systems, Inc",
      "title": "Computer Lab Tech",
      "icon": "fas fa-network-wired",
      "years": "2004 - 2006",
      "mainTech": ["Build, Maintain PCs", "Maintain Lab", "Manage LAN"],
      "technologies": [
        "Windows Server",
        "Windows Desktop",
        "Manage TCP/IP, DHCP, DNS, WINS",
        "Deploy Software and Hardware",
        "Build, Support, Service PCs, Servers",
        "Automate PC Builds"
      ]
    },
    {
      "company": "Cascadia College",
      "title": "Helpdesk Support",
      "icon": "fas fa-briefcase",
      "years": "2003, 2004",
      "mainTech": ["Staff, Student Tech Spprt", "IT generalist"],
      "technologies": [
        "Technical Support",
        "Helpdesk Application",
        "Windows Server",
        "Windows Desktop",
        "Active Directory",
        "Server Room Hardware Management",
        "Data Recovery"
      ]
    }
  ]
}
